03_OneraM6_Inviscid/OneraM6_Inviscid_rhoCentralFoam/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat       raw;

sets
(
   profile 
    {
        type    cloud;
        axis    x;
        points   (
 (   1.00000000       0.00000000       0.00000000     )
 (  0.999000311      -1.37406300E-06   0.00000000     )
 (  0.997956276       6.63465617E-05   0.00000000     )
 (  0.996864796       1.31053006E-04   0.00000000     )
 (  0.995723784       1.96467503E-04   0.00000000     )
 (  0.994531214       2.63208494E-04   0.00000000     )
 (  0.993284583       3.31141695E-04   0.00000000     )
 (  0.991981924       4.00538906E-04   0.00000000     )
 (  0.990620375       4.68996586E-04   0.00000000     )
 (  0.989197910       5.35148021E-04   0.00000000     )
 (  0.987711489       6.00496482E-04   0.00000000     )
 (  0.986158788       6.64984225E-04   0.00000000     )
 (  0.984537184       7.28642684E-04   0.00000000     )
 (  0.982843697       7.92809180E-04   0.00000000     )
 (  0.981075525       8.56423518E-04   0.00000000     )
 (  0.979229391       9.17172525E-04   0.00000000     )
 (  0.977302372       9.73603223E-04   0.00000000     )
 (  0.975291312       1.02872704E-03   0.00000000     )
 (  0.973192692       1.08054397E-03   0.00000000     )
 (  0.971003413       1.12581498E-03   0.00000000     )
 (  0.968719721       1.16773101E-03   0.00000000     )
 (  0.966338217       1.20974297E-03   0.00000000     )
 (  0.963855088       1.24125299E-03   0.00000000     )
 (  0.961266816       1.24999997E-03   0.00000000     )
 (  0.958569288       1.24999997E-03   0.00000000     )
 (  0.955758810       1.24999997E-03   0.00000000     )
 (  0.952831209       1.24999997E-03   0.00000000     )
 (  0.949782610       1.24287000E-03   0.00000000     )
 (  0.946608722       1.21272099E-03   0.00000000     )
 (  0.943305314       1.16621796E-03   0.00000000     )
 (  0.939868510       1.11170299E-03   0.00000000     )
 (  0.936293721       1.03246700E-03   0.00000000     )
 (  0.932576597       9.27200483E-04   0.00000000     )
 (  0.928713024       8.05259915E-04   0.00000000     )
 (  0.924698591       6.61135477E-04   0.00000000     )
 (  0.920528829       4.87543904E-04   0.00000000     )
 (  0.916199386       2.91350210E-04   0.00000000     )
 (  0.911705792       7.25744467E-05   0.00000000     )
 (  0.907043695      -1.76713307E-04   0.00000000     )
 (  0.902208924      -4.54002613E-04   0.00000000     )
 (  0.897197306      -7.61746312E-04   0.00000000     )
 (  0.892004490      -1.10575999E-03   0.00000000     )
 (  0.886626482      -1.48168998E-03   0.00000000     )
 (  0.881059527      -1.89128495E-03   0.00000000     )
 (  0.875299275      -2.33946089E-03   0.00000000     )
 (  0.869342506      -2.82415398E-03   0.00000000     )
 (  0.863185823      -3.35102808E-03   0.00000000     )
 (  0.856825590      -3.91995488E-03   0.00000000     )
 (  0.850258589      -4.52615786E-03   0.00000000     )
 (  0.843482018      -5.17432485E-03   0.00000000     )
 (  0.836493611      -5.86776622E-03   0.00000000     )
 (  0.829291582      -6.61186501E-03   0.00000000     )
 (  0.821874022      -7.40777981E-03   0.00000000     )
 (  0.814238429      -8.24852102E-03   0.00000000     )
 (  0.806384027      -9.13811382E-03   0.00000000     )
 (  0.798309922      -1.00759799E-02   0.00000000     )
 (  0.790015519      -1.10608796E-02   0.00000000     )
 (  0.781501114      -1.20977201E-02   0.00000000     )
 (  0.772768676      -1.31930904E-02   0.00000000     )
 (  0.763819098      -1.43501395E-02   0.00000000     )
 (  0.754652917      -1.55573599E-02   0.00000000     )
 (  0.745272219      -1.68152396E-02   0.00000000     )
 (  0.735679626      -1.81227997E-02   0.00000000     )
 (  0.725878477      -1.94802806E-02   0.00000000     )
 (  0.715872526      -2.08849106E-02   0.00000000     )
 (  0.705665171      -2.23299004E-02   0.00000000     )
 (  0.695262015      -2.38166507E-02   0.00000000     )
 (  0.684668481      -2.53429506E-02   0.00000000     )
 (  0.673891127      -2.69083008E-02   0.00000000     )
 (  0.662935376      -2.85013709E-02   0.00000000     )
 (  0.651808977      -3.01210005E-02   0.00000000     )
 (  0.640523493      -3.17885503E-02   0.00000000     )
 (  0.629089117      -3.35153304E-02   0.00000000     )
 (  0.617500722      -3.51921506E-02   0.00000000     )
 (  0.605763376      -3.67912017E-02   0.00000000     )
 (  0.593903124      -3.84140201E-02   0.00000000     )
 (  0.581934094      -4.00865711E-02   0.00000000     )
 (  0.569859982      -4.17459011E-02   0.00000000     )
 (  0.557691216      -4.33819890E-02   0.00000000     )
 (  0.545438528      -4.49796915E-02   0.00000000     )
 (  0.533113718      -4.65351492E-02   0.00000000     )
 (  0.520730495      -4.80430089E-02   0.00000000     )
 (  0.508302271      -4.95074093E-02   0.00000000     )
 (  0.495838910      -5.08913994E-02   0.00000000     )
 (  0.483353496      -5.21950200E-02   0.00000000     )
 (  0.470860600      -5.34071997E-02   0.00000000     )
 (  0.458373904      -5.45378290E-02   0.00000000     )
 (  0.445906103      -5.55470213E-02   0.00000000     )
 (  0.433469892      -5.64498790E-02   0.00000000     )
 (  0.421080887      -5.72226718E-02   0.00000000     )
 (  0.408751994      -5.78916296E-02   0.00000000     )
 (  0.396496803      -5.84027991E-02   0.00000000     )
 (  0.384329289      -5.88051900E-02   0.00000000     )
 (  0.372262508      -5.90300411E-02   0.00000000     )
 (  0.360309213      -5.91707192E-02   0.00000000     )
 (  0.348482609      -5.91706894E-02   0.00000000     )
 (  0.336793095      -5.90631589E-02   0.00000000     )
 (  0.325253308      -5.88920712E-02   0.00000000     )
 (  0.313871711      -5.85894510E-02   0.00000000     )
 (  0.302658290      -5.82257807E-02   0.00000000     )
...
 (   1.00000000       0.00000000       0.00000000     )

         );
    interpolate true ;
    }
);

fields          ( p  );


// ************************************************************************* //
